# функция одной переменной (лабы 2-3)
def f1(x):
    return x**2 + 4*x + 6

A0, B0 = -4, 6  # начальная точка (отрезок [a0; b0]) для f1



# функция двух переменных (лаба 4): a*x1^2 + b*x2^2 + c*x1*x2 + d*x1 + e*x2 + f
A, B, C, D, E, F = 7, 1, -1, 1, 0, 0
X0 = (1, 2)  # начальная точка для f2

def f2(x1, x2):
    return A*x1**2 + B*x2**2 + C*x1*x2 + D*x1 + E*x2 + F

def grad_f2(x1, x2):
    # частные производные: f_x1'(x) = 2a*x1 + c*x2 + d, f_x2'(x) = 2b*x2 + c*x1 + e
    return [2*A*x1 + C*x2 + D, 2*B*x2 + C*x1 + E]

# точка минимума f2: решение системы grad f2 = 0
# 2a*x1 + c*x2 = -d,
# c*x1 + 2b*x2 = -e
# проверки, является ли подозрительная точка минимумом, НЕТ
_DET = 4*A*B - C**2
X_MIN = ((-2*B*D + E*C) / _DET, (-2*A*E + C*D) / _DET)  # для текущих коэффициентов (-2/27; -1/27)
